
// выводит случайное трехзначное число и удаляет  вторую цифру этого числа (2 семинар, в залах)

// принимает на вход два числа и проверяет является ли одно число квадратом второго (2 семинар, в залах)

//принимает на вход два числа и проверяет является ли одно число кратным второму. Если не кратно, выводит остаток от деления (2 семинар, в залах)

// принимает на вход число и проверет кратность одновременно 7 и 23 (2 семинар, в залах)

// принимает число n и выдает таблицу квадратов чисел от 1 до n (3 семинар, в залах)

// выводит массив из 8 элементов и заполняет его случайными числами 1 и 0 (4 семинар, в залах)

// Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.(4 семинар, в залах)

// Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.(4 семинар, в залах)

// Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот. (5 семинар, в залах)
//[-4, -8, 8, 2] -> [4, 8, -8, -2] 

// Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве. (5 семинар, в залах)
// 4; массив [6, 7, 19, 345, 3] -> нет
// -3; массив [6, 7, 19, 345, -3] -> да

// задайте массив из 123 случ чисел. Найти кол-во элтов массива, котор лежат в отрезке от 10 до 99 (5 семинар, в залах)

// Найти произведение пар чисел в массиве. Пара - 1 и посл, 2 и предпосл... ответ записать в новом массиве (5 семинар, в залах) 
//Сложная, лучше не выносить мозг

// переворот массива (6 семинар, демонстрация)

// копия массива поэлементно (6 семинар, в залах) 

//




